Функция ПолучитьДанные(Идентификатор)
    
    Попытка
        Запрос = Новый Запрос;
        Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Товары.Ссылка КАК Ссылка ИЗ Справочник.Номенклатура КАК Товары ГДЕ Товары.Ссылка = &ID";
        Запрос.УстановитьПараметр("ID", Идентификатор);
        
        Выборка = Запрос.Выполнить().Выбрать();
        Если Не Выборка.Следующий() Тогда
            Возврат Неопределено;
        КонецЕсли;
        
        Возврат Выборка.Ссылка;
        
    Исключение
        Сообщить("Ошибка получения данных: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции
