Запрос = Новый Запрос;
Запрос.Текст = "Выбрать Идентификатор, Сумма Из Документы.Продажа";
Выборка = Запрос.Выполнить().Выбрать();
ВсеДанные = Новый ТаблицаЗначений;
ВсеДанные.Колонки.Добавить("Идентификатор");
ВсеДанные.Колонки.Добавить("Сумма");
Пока Выборка.Следующий() Цикл
    НоваяСтрока = ВсеДанные.Добавить();
    НоваяСтрока.Идентификатор = Выборка.Идентификатор;
    НоваяСтрока.Сумма = Выборка.Сумма;
КонецЦикла;

// Обработка данных из таблицы в памяти
Для Каждого Строка Из ВсеДанные Цикл
    // Быстрая обработка без обращений к БД
КонецЦикла
