Функция СписокGET(Запрос) Экспорт
    
    Ответ = Новый HTTPСервисОтвет(200);
    Выборка = Справочники.Номенклатура.Выбрать();
    
    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    Запись.ЗаписатьНачалоМассива();
    
    Пока Выборка.Следующий() Цикл
        Запись.ЗаписатьНачалоОбъекта();
        Запись.ЗаписатьИмяСвойства("Код");
        Запись.ЗаписатьЗначение(Выборка.Код);
        Запись.ЗаписатьИмяСвойства("Наименование");
        Запись.ЗаписатьЗначение(Выборка.Наименование);
        Запись.ЗаписатьКонецОбъекта();
    КонецЦикла;
    
    Запись.ЗаписатьКонецМассива();
    Тело = Запись.Закрыть();
    
    Ответ.УстановитьТелоИзСтроки(Тело);
    Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Возврат Ответ;
    
КонецФункции
