Процедура ОбработкаПроведения(Отказ, РежимПроведения)

    Движения.ОстаткиТоваров.Записывать = Истина;

    Для Каждого СтрокаТЧ Из Товары Цикл

        Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
            Продолжить;
        КонецЕсли;

        Движение = Движения.ОстаткиТоваров.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
        Движение.Период = Дата;
        Движение.Склад = Склад;
        Движение.Номенклатура = СтрокаТЧ.Номенклатура;
        Движение.Количество = СтрокаТЧ.Количество;

    КонецЦикла;

КонецПроцедуры
