SELECT EMP-FILE ASSIGN TO "EMP.DAT"
    FILE STATUS IS WS-FS.

...

READ EMP-FILE
    AT END MOVE "Y" TO EOF-FLAG
END-READ.

EVALUATE WS-FS
    WHEN "00" CONTINUE
    WHEN "10" DISPLAY "Конец файла"
    WHEN "23" DISPLAY "Запись не найдена"
    WHEN OTHER DISPLAY "Ошибка: " WS-FS
END-EVALUATE.
